from pathlib import Path, PurePath

dirpath = Path(__file__).parent
basepath = PurePath(dirpath, 'community_token.txt')
community_token = open(basepath, 'r').read()

stress_symbols = {
    'А':'а́',
    'Е':'е́',
    'И':'и́',
    'О':'о́',
    'У':'у́',
    'Ы':'ы́',
    'Э':'э́',
    'Ю':'ю́',
    'Я':'я́',
    'Ё':'ё'
}

stress_symbols_for_all = {
    'А':'а́',
    'Е':'е́',
    'И':'и́',
    'О':'о́',
    'У':'у́',
    'Ы':'ы́',
    'Э':'э́',
    'Ю':'ю́',
    'Я':'я́',
    'Ё':'ё',
    'а':'а́',
    'е':'е́',
    'и':'и́',
    'о':'о́',
    'у':'у́',
    'ы':'ы́',
    'э':'э́',
    'ю':'ю́',
    'я':'я́',
    'ё':'ё'
}

a_letters = 'АЕИОУЫЭЮЯЁаеиоуыэюяё'

keyboard_template = {
   "one_time":True,
   "buttons":[]
}

emoji = ['🍕', '❤', '🙃', '💥', '⭐', '🌟', '🌝', '🌈', '⚡', '🍀', '🌻', '🔥', '🧭', '🚀', '✨', '🎈', '💡', '📓', '📒', '📃', '📜', '📄', '✉', '💼', '📝', '✏', '✒', '🖋', '🖊', '🖌', '🖍', '📋', '📍', '📎', '🗿']

goodTemplates = [
    'Верно!',
    'Правильно!',
    'Отлично!',
    'Ответ верный.',
    'Верно.',
    'Правильно.'
]

goodEmoji = ['✅','💚','👌🏻','👍🏻','👀','😎','🤩','😇']

badTemplates = [
    'Неверно!',
    'Мимо!',
    'Ответ неверный.',
    'Неправильно!',
    'Ударение указано неправильно.',
    'Неверно.',
    'Мимо.'
]

badEmoji = ['😖','🤕','👎🏻','💔','⛔','🚫']


